Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Driver/Source/Config/XMC4300_F100/RTE_Device.h
//   <o> I2S2_WS INPUT Pin <0=>P0_6
#define RTE_I2S2_WS_INPUT_ID                 0
#if    (RTE_I2S2_WS_INPUT_ID == 0)
#define RTE_I2S2_WS_INPUT_PORT               P0_6
#define RTE_I2S2_WS_INPUT_ID_INPUT           USIC1_C0_DX2_P0_6
#else
#error "Invalid I2S2_WS Input Pin Configuration!"
#endif

#define RTE_I2S2_MCLK_OUTPUT_ENABLE          0

//   <o> I2S2_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_I2S2_RX_FIFO_SIZE_ID                4
#if    (RTE_I2S2_RX_FIFO_SIZE_ID == 0)
#define RTE_I2S2_RX_FIFO_SIZE         NO_FIFO
#define RTE_I2S2_RX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S2_RX_FIFO_SIZE_ID == 1)
#define RTE_I2S2_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S2_RX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S2_RX_FIFO_SIZE_ID == 2)
#define RTE_I2S2_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S2_RX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S2_RX_FIFO_SIZE_ID == 3)
#define RTE_I2S2_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S2_RX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S2_RX_FIFO_SIZE_ID == 4)
#define RTE_I2S2_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S2_RX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S2_RX_FIFO_SIZE_ID == 5)
#define RTE_I2S2_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S2_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S2_RX FIFO SIZE Configuration!"
#endif

//   <o> I2S2_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_I2S2_TX_FIFO_SIZE_ID                4
#if    (RTE_I2S2_TX_FIFO_SIZE_ID == 0)
#define RTE_I2S2_TX_FIFO_SIZE         NO_FIFO
#define RTE_I2S2_TX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S2_TX_FIFO_SIZE_ID == 1)
#define RTE_I2S2_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S2_TX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S2_TX_FIFO_SIZE_ID == 2)
#define RTE_I2S2_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S2_TX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S2_TX_FIFO_SIZE_ID == 3)
#define RTE_I2S2_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S2_TX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S2_TX_FIFO_SIZE_ID == 4)
#define RTE_I2S2_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S2_TX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S2_TX_FIFO_SIZE_ID == 5)
#define RTE_I2S2_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S2_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S2_TX FIFO SIZE Configuration!"
#endif

// <o>IRQ Priority <0-63>
// <i> Defines priority of I2S events IRQ handling
// <i> Default: 63
#define RTE_I2S2_IRQ_PRIORITY  63

//</e>

// <e> I2S3 (Inter-Integrated Sound) [Driver_SAI3]
// <i> Configuration settings for Driver_SAI3 in component ::Drivers:SAI
#define RTE_I2S3                      0

//   <o> I2S3_TX Pin <0=>P0_1 <1=>P1_9
#define RTE_I2S3_TX_ID                0
#if    (RTE_I2S3_TX_ID == 0)
#define RTE_I2S3_TX_PORT              P0_1
#define RTE_I2S3_TX_AF                P0_1_AF_U1C1_DOUT0
#elif  (RTE_I2S3_TX_ID == 1)
#define RTE_I2S3_TX_PORT              P1_9
#define RTE_I2S3_TX_AF                P1_9_AF_U1C1_DOUT0
#else
#error "Invalid I2S3_TX Pin Configuration!"
#endif

//   <o> I2S3_RX Pin <0=>P0_0
#define RTE_I2S3_RX_ID                0
#if    (RTE_I2S3_RX_ID == 0)
#define RTE_I2S3_RX_PORT              P0_0
#define RTE_I2S3_RX_INPUT             USIC1_C1_DX0_P0_0
#else
#error "Invalid I2S3_RX Pin Configuration!"
#endif

//   <o> I2S3_CLK OUTPUT Pin <0=>P0_10 <2=>P1_8
#define RTE_I2S3_CLK_OUTPUT_ID                0
#if    (RTE_I2S3_CLK_OUTPUT_ID == 0)
#define RTE_I2S3_CLK_OUTPUT_PORT              P0_10
#define RTE_I2S3_CLK_AF                       P0_10_AF_U1C1_SCLKOUT
#elif  (RTE_I2S3_CLK_OUTPUT_ID == 2)
#define RTE_I2S3_CLK_OUTPUT_PORT              P1_8
#define RTE_I2S3_CLK_AF                       P1_8_AF_U1C1_SCLKOUT
#else
#error "Invalid I2S3 CLOCK OUTPUT Pin Configuration!"
#endif

//   <o> I2S3_CLK INPUT Pin <0=>P0_10 <2=>P4_0
#define RTE_I2S3_CLK_INPUT_ID                0
#if    (RTE_I2S3_CLK_INPUT_ID == 0)
#define RTE_I2S3_CLK_INPUT_PORT              P0_10
#define RTE_I2S3_CLK_INPUT                   USIC1_C1_DX1_P0_10
#elif  (RTE_I2S3_CLK_INPUT_ID == 2)
#define RTE_I2S3_CLK_INPUT_PORT              P4_0
#define RTE_I2S3_CLK_INPUT                   USIC1_C1_DX1_P4_0
#else
#error "Invalid I2S3 CLOCK INPUT Pin Configuration!"
#endif

//   <o> I2S3_WS OUTPUT Pin <0=>P0_9 <1=>P0_12
#define RTE_I2S3_WS_OUTPUT_ID                0
#if     (RTE_I2S3_WS_OUTPUT_ID == 0)
#define RTE_I2S3_WS_OUTPUT_PORT              P0_9
#define RTE_I2S3_WS_AF                       P0_9_AF_U1C1_SELO0
#elif   (RTE_I2S3_WS_OUTPUT_ID == 1)
#define RTE_I2S3_WS_OUTPUT_PORT              P0_12
#define RTE_I2S3_WS_AF                       P0_12_AF_U1C1_SELO0
#else
#error "Invalid I2S3_WS Output Pin Configuration!"
#endif

//   <o> I2S3_WS INPUT Pin <0=>P0_9 <1=>P0_12
#define RTE_I2S3_WS_INPUT_ID                 0
#if    (RTE_I2S3_WS_INPUT_ID == 0)
#define RTE_I2S3_WS_INPUT_PORT               P0_9
#define RTE_I2S3_WS_INPUT_ID_INPUT           USIC1_C1_DX2_P0_9
#elif  (RTE_I2S3_WS_INPUT_ID == 1)
#define RTE_I2S3_WS_INPUT_PORT               P0_12
#define RTE_I2S3_WS_INPUT_ID_INPUT           USIC1_C1_DX2_P0_12
#else
#error "Invalid I2S3_WS Input Pin Configuration!"
#endif

// <e> Enable MCLK output
#define RTE_I2S3_MCLK_OUTPUT_ENABLE          0
//   <o> I2S3_MCLK OUTPUT Pin <0=>P4_1
#define RTE_I2S3_MCLK_OUTPUT_ID              0
#if    (RTE_I2S3_MCLK_OUTPUT_ID == 0)
#define RTE_I2S3_MCLK_OUTPUT_PORT            P4_1
#define RTE_I2S3_MCLK_AF                     P4_1_AF_U1C1_MCLKOUT
#else
#error "Invalid I2S3_MCLK Output Pin Configuration!"
#endif
// </e>

//   <o> I2S3_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_I2S3_RX_FIFO_SIZE_ID                4
#if    (RTE_I2S3_RX_FIFO_SIZE_ID == 0)
#define RTE_I2S3_RX_FIFO_SIZE         NO_FIFO
#define RTE_I2S3_RX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 1)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S3_RX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 2)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S3_RX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 3)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S3_RX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 4)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S3_RX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 5)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S3_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S3_RX FIFO SIZE Configuration!"
#endif

