Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Driver/Source/Config/XMC4300_F100/RTE_Device.h
// <e> MCI Write protection pin enable
#define RTE_SDMMC_WP_PIN_EN             0
//   <o> MCI Write Protection Pin <0=>P1_1
#define RTE_SDMMC0_WP_PIN_ID            0
#if (RTE_SDMMC0_WP_PIN_ID == 0)
#define RTE_SDMMC_WRITE_PROTECT_PORT    PORT1_BASE
#define RTE_SDMMC_WRITE_PROTECT_PIN     1
#else
#error "Invalid SDMMC0_WP Pin Configuration!"
#endif
// </e>

// <e> MCI Power pin enable
#define RTE_SDMMC_PWR_PIN_EN            0
//   <o> MCI Bus Power Pin <0=>P3_4
#define RTE_SDMMC0_BUS_POWER_PIN_ID     0
#if (RTE_SDMMC0_BUS_POWER_PIN_ID == 0)
#define RTE_SDMMC_BUS_POWER_PORT        PORT3_BASE
#define RTE_SDMMC_BUS_POWER_PIN         4
#else
#error "Invalid SDMMC0_BUS_POWER Pin Configuration!"
#endif
// </e>

// <e> MCI Reset pin enable
#define RTE_SDMMC_RESET_PIN_EN          0
//   <o> MCI Reset Pin <0=>P0_11
#define RTE_SDMMC0_RESET_PIN_ID         0
#if (RTE_SDMMC0_RESET_PIN_ID == 0)
#define RTE_SDMMC_RESET_PORT            PORT0_BASE
#define RTE_SDMMC_RESET_PIN             11
#else
#error "Invalid SDMMC0_RESET Pin Configuration!"
#endif
// </e>

// <o> MCI DATA0 Pin <0=>P4_0
#define RTE_SDMMC0_DATA0_PIN_ID         0
#if (RTE_SDMMC0_DATA0_PIN_ID == 0)
#define RTE_SDMMC_DATA_0_PORT           PORT4_BASE
#define RTE_SDMMC_DATA_0_PIN            0
#else
#error "Invalid SDMMC0_DATA0 Pin Configuration!"
#endif

// <e> MCI 4 bit bus width enable
#define RTE_SDMMC_BUS_WIDTH_4           1

//   <o> MCI DATA1 Pin <0=>P1_6
#define RTE_SDMMC0_DATA1_PIN_ID         0
#if (RTE_SDMMC0_DATA1_PIN_ID == 0)
#define RTE_SDMMC_DATA_1_PORT           PORT1_BASE
#define RTE_SDMMC_DATA_1_PIN            6
#else
#error "Invalid SDMMC0_DATA1 Pin Configuration!"
#endif

//   <o> MCI DATA2 Pin <0=>P1_7
#define RTE_SDMMC0_DATA2_PIN_ID         0
#if (RTE_SDMMC0_DATA2_PIN_ID == 0)
#define RTE_SDMMC_DATA_2_PORT           PORT1_BASE
#define RTE_SDMMC_DATA_2_PIN            7
#else
#error "Invalid SDMMC0_DATA2 Pin Configuration!"
#endif

//   <o> MCI DATA3 Pin <0=>P4_1
#define RTE_SDMMC0_DATA3_PIN_ID         0
#if (RTE_SDMMC0_DATA3_PIN_ID == 0)
#define RTE_SDMMC_DATA_3_PORT           PORT4_BASE
#define RTE_SDMMC_DATA_3_PIN            1
#else
#error "Invalid SDMMC0_DATA3 Pin Configuration!"
#endif
// </e>

// <o> MCI CMD Pin <0=>P3_5
#define RTE_SDMMC0_CMD_PIN_ID           0
#if (RTE_SDMMC0_CMD_PIN_ID == 0)
#define RTE_SDMMC_COMMAND_PORT          PORT3_BASE
#define RTE_SDMMC_COMMAND_PIN           5
#else
#error "Invalid SDMMC0_CMD Pin Configuration!"
#endif

// <o> MCI CLK Pin <0=>P3_6
#define RTE_SDMMC0_CLK_PIN_ID           0
#if (RTE_SDMMC0_CLK_PIN_ID == 0)
#define RTE_SDMMC_CLK_PORT              PORT3_BASE
#define RTE_SDMMC_CLK_PIN               6
#else
#error "Invalid SDMMC0_CLK Pin Configuration!"
#endif

// <o>IRQ Priority <0-63>
// <i> Defines priority of SDMMC events IRQ handling
// <i> Default: 63
#define RTE_SDMMC_IRQ_PRIORITY  63

// </e> SD/MMC Interface [Driver_MCI0]

#if ((RTE_UART0+RTE_I2C0+RTE_SPI0+RTE_I2S0)>1)
#error "Choose just one Driver_I2C0/SPI0/UART0/SAI0 driver !"
#elif ((RTE_UART1+RTE_I2C1+RTE_SPI1+RTE_I2S1)>1)
#error "Choose just one Driver_I2C1/SPI1/UART1/SAI1 driver !"
#elif ((RTE_UART2+RTE_I2C2+RTE_SPI2+RTE_I2S2)>1)
#error "Choose just one Driver_I2C2/SPI2/UART2/SAI2 driver !"
#elif ((RTE_UART3+RTE_I2C3+RTE_SPI3+RTE_I2S3)>1)
#error "Choose just one Driver_I2C3/SPI3/UART3/SAI3 driver !"
#endif

#if (((RTE_UART0_RX_FIFO_SIZE_NUM*RTE_UART0)+\
      (RTE_I2C0_RX_FIFO_SIZE_NUM*RTE_I2C0)+\
      (RTE_SPI0_RX_FIFO_SIZE_NUM*RTE_SPI0)+\
      (RTE_I2S0_RX_FIFO_SIZE_NUM*RTE_I2S0)+\
      (RTE_UART1_RX_FIFO_SIZE_NUM*RTE_UART1)+\
      (RTE_I2C1_RX_FIFO_SIZE_NUM*RTE_I2C1)+\
      (RTE_SPI1_RX_FIFO_SIZE_NUM*RTE_SPI1)+\
      (RTE_I2S1_RX_FIFO_SIZE_NUM*RTE_I2S1)+\
      (RTE_UART0_TX_FIFO_SIZE_NUM*RTE_UART0)+\
      (RTE_I2C0_TX_FIFO_SIZE_NUM*RTE_I2C0)+\
      (RTE_SPI0_TX_FIFO_SIZE_NUM*RTE_SPI0)+\
      (RTE_I2S0_TX_FIFO_SIZE_NUM*RTE_I2S0)+\
      (RTE_UART1_TX_FIFO_SIZE_NUM*RTE_UART1)+\
      (RTE_I2C1_TX_FIFO_SIZE_NUM*RTE_I2C1)+\
      (RTE_SPI1_TX_FIFO_SIZE_NUM*RTE_SPI1)+\
      (RTE_I2S1_TX_FIFO_SIZE_NUM*RTE_I2S1))>64)
#error "Just 64 positions in a FIFO shared by RTE_x0 and RTE_x1 !"
#elif (((RTE_UART2_RX_FIFO_SIZE_NUM*RTE_UART2)+\
        (RTE_I2C2_RX_FIFO_SIZE_NUM*RTE_I2C2)+\
        (RTE_SPI2_RX_FIFO_SIZE_NUM*RTE_SPI2)+\
        (RTE_I2S2_RX_FIFO_SIZE_NUM*RTE_I2S2)+\
        (RTE_UART3_RX_FIFO_SIZE_NUM*RTE_UART3)+\
        (RTE_I2C3_RX_FIFO_SIZE_NUM*RTE_I2C3)+\
        (RTE_SPI3_RX_FIFO_SIZE_NUM*RTE_SPI3)+\
        (RTE_I2S3_RX_FIFO_SIZE_NUM*RTE_I2S3)+\
        (RTE_UART2_TX_FIFO_SIZE_NUM*RTE_UART2)+\
        (RTE_I2C2_TX_FIFO_SIZE_NUM*RTE_I2C2)+\
        (RTE_SPI2_TX_FIFO_SIZE_NUM*RTE_SPI2)+\
        (RTE_I2S2_TX_FIFO_SIZE_NUM*RTE_I2S2)+\
        (RTE_UART3_TX_FIFO_SIZE_NUM*RTE_UART3)+\
        (RTE_I2C3_TX_FIFO_SIZE_NUM*RTE_I2C3)+\
        (RTE_SPI3_TX_FIFO_SIZE_NUM*RTE_SPI3)+\
        (RTE_I2S3_TX_FIFO_SIZE_NUM*RTE_I2S3))>64)
#error "Just 64 positions in a FIFO shared by RTE_x2 and RTE_x3 !"
#endif

#endif  /* __RTE_DEVICE_H */
